In [1]:
import pandas as pd

dict1 = {'Name': ['Abhijeet Bhatt', ' Suhas Pande', 'Ajit Patil', 'Saniya Mirja'],
        'City':[' Sangli', 'Kolhapur ', 'Pune ', ' Belgum '],
        'State':['MH', 'MH', 'MH', 'KA']}
df = pd.DataFrame(dict1)
df

             Name       City State
0  Abhijeet Bhatt     Sangli    MH
1     Suhas Pande  Kolhapur     MH
2      Ajit Patil      Pune     MH
3    Saniya Mirja    Belgum     KA

In [2]:
df1 = df.copy()
df1

             Name       City State
0  Abhijeet Bhatt     Sangli    MH
1     Suhas Pande  Kolhapur     MH
2      Ajit Patil      Pune     MH
3    Saniya Mirja    Belgum     KA

### 1. str.lower()  and str.upper()

In [3]:
df['Name'].str.lower()

0    abhijeet bhatt
1       suhas pande
2        ajit patil
3      saniya mirja
Name: Name, dtype: object

In [4]:
df['Name_Lower'] = df['Name'].str.lower()
df

             Name       City State      Name_Lower
0  Abhijeet Bhatt     Sangli    MH  abhijeet bhatt
1     Suhas Pande  Kolhapur     MH     suhas pande
2      Ajit Patil      Pune     MH      ajit patil
3    Saniya Mirja    Belgum     KA    saniya mirja

In [5]:
df['Name_Upper'] = df['Name'].str.upper()
df

             Name       City State      Name_Lower      Name_Upper
0  Abhijeet Bhatt     Sangli    MH  abhijeet bhatt  ABHIJEET BHATT
1     Suhas Pande  Kolhapur     MH     suhas pande     SUHAS PANDE
2      Ajit Patil      Pune     MH      ajit patil      AJIT PATIL
3    Saniya Mirja    Belgum     KA    saniya mirja    SANIYA MIRJA

### str.len()

In [6]:
df['Name'].str.len()

0    14
1    12
2    10
3    12
Name: Name, dtype: int64

In [7]:
df['Name_len']= df['Name'].str.len()
df

             Name       City State      Name_Lower      Name_Upper  Name_len
0  Abhijeet Bhatt     Sangli    MH  abhijeet bhatt  ABHIJEET BHATT        14
1     Suhas Pande  Kolhapur     MH     suhas pande     SUHAS PANDE        12
2      Ajit Patil      Pune     MH      ajit patil      AJIT PATIL        10
3    Saniya Mirja    Belgum     KA    saniya mirja    SANIYA MIRJA        12

### 3. str.strip()

In [8]:
df['City'][3]

' Belgum '

In [9]:
df['City_strip']= df['City'].str.strip()
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum

In [10]:
df['City_strip'][3]

'Belgum'

In [11]:
df["City"].str.lstrip()

0       Sangli
1    Kolhapur
2        Pune
3      Belgum
Name: City, dtype: object

In [12]:
df['City'].str.rstrip()

0      Sangli
1    Kolhapur
2        Pune
3      Belgum
Name: City, dtype: object

#### 4. str.split()

In [13]:
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum

In [14]:
df['Name'].str.split(' ')

0    [Abhijeet, Bhatt]
1     [, Suhas, Pande]
2        [Ajit, Patil]
3      [Saniya, Mirja]
Name: Name, dtype: object

In [15]:
df['Name']= df['Name'].str.strip()

In [16]:
df[['First_Name', 'Last_Name']] = df['Name'].str.split(' ', expand= True)
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli,Abhijeet,Bhatt
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur,Suhas,Pande
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune,Ajit,Patil
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum,Saniya,Mirja

### 5. str.comtains()

In [19]:
df[df["Name"].str.contains('Suhas')]

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur,Suhas,Pande

### 6. str.repalce()

In [20]:
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli,Abhijeet,Bhatt
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur,Suhas,Pande
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune,Ajit,Patil
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum,Saniya,Mirja

In [21]:
df['State'].str.replace('MH', 'Maharashtra')

0    Maharashtra
1    Maharashtra
2    Maharashtra
3             KA
Name: State, dtype: object

In [22]:
df["Replaced_State"]= df['State'].str.replace('MH', 'Maharashtra')

In [23]:
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name,Replaced_State
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli,Abhijeet,Bhatt,Maharashtra
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur,Suhas,Pande,Maharashtra
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune,Ajit,Patil,Maharashtra
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum,Saniya,Mirja,KA

In [24]:
df["Replaced_State"]= df['State'].str.replace('MH', 'Maharashtra').str.replace('KA', "Karnataka")
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name,Replaced_State
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli,Abhijeet,Bhatt,Maharashtra
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur,Suhas,Pande,Maharashtra
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune,Ajit,Patil,Maharashtra
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum,Saniya,Mirja,Karnataka

### 7. str.startswith()  and  str.endswith()

In [27]:
df['First_Name'].str.startswith('A')

0     True
1    False
2     True
3    False
Name: First_Name, dtype: bool

In [28]:
df[df['First_Name'].str.startswith('A')]

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name,Replaced_State
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli,Abhijeet,Bhatt,Maharashtra
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune,Ajit,Patil,Maharashtra

In [38]:
df['First_Name'].str.endswith('a')

0    False
1    False
2    False
3     True
Name: First_Name, dtype: bool

In [31]:
df[df['First_Name'].str.endswith('a')]

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name,Replaced_State
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum,Saniya,Mirja,Karnataka

### 8.  str.cat()

In [40]:
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name,Replaced_State
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli,Abhijeet,Bhatt,Maharashtra
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur,Suhas,Pande,Maharashtra
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune,Ajit,Patil,Maharashtra
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum,Saniya,Mirja,Karnataka

In [41]:
df['First_Name'].str.cat(df['Last_Name'], sep = " ")

0    Abhijeet Bhatt
1       Suhas Pande
2        Ajit Patil
3      Saniya Mirja
Name: First_Name, dtype: object

In [43]:
df['Full_Name']= df['First_Name'].str.cat(df['Last_Name'], sep = " ")
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name,Replaced_State,Full_Name
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli,Abhijeet,Bhatt,Maharashtra,Abhijeet Bhatt
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur,Suhas,Pande,Maharashtra,Suhas Pande
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune,Ajit,Patil,Maharashtra,Ajit Patil
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum,Saniya,Mirja,Karnataka,Saniya Mirja

### 9. str.get()

In [44]:
df['Name'].str.get(0)

0    A
1    S
2    A
3    S
Name: Name, dtype: object

In [45]:
df["Name"].str.get(-1)

0    t
1    e
2    l
3    a
Name: Name, dtype: object

In [46]:
df["Name"].str.split().str.get(0)

0    Abhijeet
1       Suhas
2        Ajit
3      Saniya
Name: Name, dtype: object

In [47]:
df["Name"].str.split().str.get(-1)

0    Bhatt
1    Pande
2    Patil
3    Mirja
Name: Name, dtype: object

### 10. str.slice()

In [50]:
df['Name'].str.slice(0)

0    Abhijeet Bhatt
1       Suhas Pande
2        Ajit Patil
3      Saniya Mirja
Name: Name, dtype: object

In [51]:
df['Name'].str.slice(0, 3)

0    Abh
1    Suh
2    Aji
3    San
Name: Name, dtype: object

In [52]:
df['Name'].str.slice(-1)

0    t
1    e
2    l
3    a
Name: Name, dtype: object

In [53]:
df['Name'].str.slice(-3)

0    att
1    nde
2    til
3    rja
Name: Name, dtype: object

In [54]:
df['Name'].str.slice(0,3)+ ' '+df['State']

0    Abh MH
1    Suh MH
2    Aji MH
3    San KA
dtype: object

In [56]:
df["Name_State"] = df['Name'].str.slice(0,3)+ ' '+df['State']
df

,Name,City,State,Name_Lower,Name_Upper,Name_len,City_strip,First_Name,Last_Name,Replaced_State,Full_Name,Name_State
0,Abhijeet Bhatt,Sangli,MH,abhijeet bhatt,ABHIJEET BHATT,14,Sangli,Abhijeet,Bhatt,Maharashtra,Abhijeet Bhatt,Abh MH
1,Suhas Pande,Kolhapur,MH,suhas pande,SUHAS PANDE,12,Kolhapur,Suhas,Pande,Maharashtra,Suhas Pande,Suh MH
2,Ajit Patil,Pune,MH,ajit patil,AJIT PATIL,10,Pune,Ajit,Patil,Maharashtra,Ajit Patil,Aji MH
3,Saniya Mirja,Belgum,KA,saniya mirja,SANIYA MIRJA,12,Belgum,Saniya,Mirja,Karnataka,Saniya Mirja,San KA

### 11. str.find()

In [58]:
df['Name']

0    Abhijeet Bhatt
1       Suhas Pande
2        Ajit Patil
3      Saniya Mirja
Name: Name, dtype: object

In [59]:
df['Name'].str.find('i')

0    3
1   -1
2    2
3    3
Name: Name, dtype: int64

In [60]:
df['Name'].str.rfind('i')

0    3
1   -1
2    8
3    8
Name: Name, dtype: int64